{
    "__initial_event__": {
        "Submitted": 1
    },
    "__final_event__": {
        "Closed": 1
    },
    "Submitted": {
        "Submitted": 0.05,
        "Backlog": 0.5,
        "In Progress": 0.2,
        "Under Code Review": 0.05,
        "Code Complete": 0.05,
        "QE Review": 0.05,
        "PO Review": 0.05,
        "Ready for Merge": 0.0,
        "Closed": 0.05
    },
    "Backlog": {
        "Submitted": 0.05,
        "Backlog": 0.1,
        "In Progress": 0.5,
        "Under Code Review": 0.05,
        "Code Complete": 0.05,
        "QE Review": 0.05,
        "PO Review": 0.05,
        "Ready for Merge": 0.05,
        "Closed": 0.1
    },
    "In Progress": {
        "Submitted": 0.05,
        "Backlog": 0.05,
        "In Progress": 0.05,
        "Under Code Review": 0.55,
        "Code Complete": 0.05,
        "QE Review": 0.05,
        "PO Review": 0.05,
        "Ready for Merge": 0.05,
        "Closed": 0.1
    },
    "Under Code Review": {
        "Submitted": 0.05,
        "Backlog": 0.05,
        "In Progress": 0.55,
        "Under Code Review": 0.05,
        "Code Complete": 0.05,
        "QE Review": 0.05,
        "PO Review": 0.05,
        "Ready for Merge": 0.05,
        "Closed": 0.1
    },
    "Code Complete": {
        "Submitted": 0.05,
        "Backlog": 0.05,
        "In Progress": 0.15,
        "Under Code Review": 0.25,
        "Code Complete": 0.05,
        "QE Review": 0.3,
        "PO Review": 0.05,
        "Ready for Merge": 0.05,
        "Closed": 0.05
    },
    "QE Review": {
        "Submitted": 0.05,
        "Backlog": 0.05,
        "In Progress": 0.15,
        "Under Code Review": 0.2,
        "Code Complete": 0.2,
        "QE Review": 0.05,
        "PO Review": 0.2,
        "Ready for Merge": 0.05,
        "Closed": 0.05
    },
    "PO Review": {
        "Submitted": 0.05,
        "Backlog": 0.05,
        "In Progress": 0.2,
        "Under Code Review": 0.05,
        "Code Complete": 0.05,
        "QE Review": 0.05,
        "PO Review": 0.0,
        "Ready for Merge": 0.5,
        "Closed": 0.05
    },
    "Ready for Merge": {
        "Submitted": 0.0,
        "Backlog": 0.05,
        "In Progress": 0.05,
        "Under Code Review": 0.05,
        "Code Complete": 0.05,
        "QE Review": 0.05,
        "PO Review": 0.05,
        "Ready for Merge": 0.0,
        "Closed": 0.7
    },
    "ACTOR": {
        "None": 0.2,
        "RPA": 0.2,
        "AI": 0.2,
        "Integration": 0.2,
        "Other": 0.2
    },
    "COMPONENT": {
        "Authentication": 0.076,
        "Authorization": 0.064,
        "Bug Tracking": 0.063,
        "Build and Deployment": 0.053,
        "Change Management": 0.051,
        "Code Review": 0.044,
        "Collaboration": 0.042,
        "Continuous Integration": 0.040,
        "Database": 0.036,
        "Documentation": 0.034,
        "Error Handling": 0.032,
        "Front-end Development": 0.030,
        "Infrastructure": 0.028,
        "Integration Testing": 0.026,
        "Logging": 0.024,
        "Performance Testing": 0.010,
        "Reporting and Analytics": 0.010,
        "Security": 0.010,
        "Server Configuration": 0.010,
        "User Interface": 0.010,
        "Version Control": 0.010,
        "Workflow Management": 0.010
    },
    "PRIORITY": {
        "Blocker": 0.03,
        "Critical": 0.03,
        "Major": 0.03,
        "High": 0.03,
        "Medium-High": 0.03,
        "Medium": 0.03,
        "Medium-Low": 0.03,
        "Low": 0.03,
        "Minor": 0.03,
        "Trivial": 0.03,
        "Showstopper": 0.03,
        "Urgent": 0.03,
        "Critical-High": 0.03,
        "Critical-Medium": 0.03,
        "Critical-Low": 0.03,
        "Important": 0.02,
        "Very Important": 0.02,
        "Lowest": 0.02,
        "Top Priority": 0.02,
        "Feature Request": 0.02
    },
    "STORY_POINTS": {
        "1": 0.25,
        "2": 0.3,
        "3": 0.25,
        "5": 0.1,
        "7": 0.1
    },
    "LABEL": {
        "Bug": 0.15,
        "Enhancement": 0.10,
        "Feature": 0.10,
        "Task": 0.10,
        "Documentation": 0.08,
        "User Story": 0.08,
        "Technical Debt": 0.07,
        "UI": 0.05,
        "UX": 0.05,
        "Backend": 0.05,
        "Frontend": 0.05,
        "API": 0.04,
        "Database": 0.04,
        "Security": 0.03,
        "Performance": 0.03,
        "Deployment": 0.03,
        "Testing": 0.02,
        "Integration": 0.02,
        "Support": 0.02,
        "Duplicate": 0.01
    },
    "ISSUE_TYPE": {
        "Bug": 0.12,
        "Task": 0.10,
        "Story": 0.10,
        "Epic": 0.08,
        "Improvement": 0.08,
        "New Feature": 0.07,
        "Sub-task": 0.07,
        "Documentation": 0.06,
        "Technical Task": 0.05,
        "User Story": 0.05,
        "Support": 0.04,
        "Test": 0.04,
        "Research": 0.03,
        "Spike": 0.03,
        "Security": 0.02,
        "Performance": 0.02,
        "Infrastructure": 0.02,
        "Maintenance": 0.01,
        "Duplicate": 0.01,
        "Other": 0.01
    },
    "SPRINT": {
        "Sprint 1": 0.12,
        "Sprint 2": 0.10,
        "Sprint 3": 0.10,
        "Sprint 4": 0.08,
        "Sprint 5": 0.08,
        "Sprint 6": 0.07,
        "Sprint 7": 0.07,
        "Sprint 8": 0.06,
        "Sprint 9": 0.05,
        "Sprint 10": 0.05,
        "Sprint 11": 0.04,
        "Sprint 12": 0.04,
        "Sprint 13": 0.03,
        "Sprint 14": 0.03,
        "Sprint 15": 0.02,
        "Sprint 16": 0.02,
        "Sprint 17": 0.02,
        "Sprint 18": 0.01,
        "Sprint 19": 0.01,
        "Sprint 20": 0.01
    },
    "TEAM": {
        "Code Crusaders": 0.08,
        "Bug Busters": 0.07,
        "Agile Avengers": 0.06,
        "Bug Squashers": 0.06,
        "Innovation Instigators": 0.05,
        "Code Commandos": 0.05,
        "Feature Force": 0.04,
        "Task Titans": 0.04,
        "Tech Tacticians": 0.03,
        "Resolution Rangers": 0.03,
        "Pixel Pioneers": 0.03,
        "Scrum Masters": 0.03,
        "Quality Quest": 0.02,
        "Defect Destroyers": 0.02,
        "Creative Coders": 0.02,
        "Debugging Dynamos": 0.02,
        "Productivity Prodigies": 0.02,
        "Solution Seekers": 0.02,
        "Mighty Modifiers": 0.01,
        "Infinite Innovators": 0.01,
        "Code Crafters": 0.01,
        "Bug Blitzers": 0.01,
        "Agile Aces": 0.01,
        "Innovation Architects": 0.01,
        "Feature Fanatics": 0.01,
        "Task Trackers": 0.01,
        "Tech Transformers": 0.01,
        "Resolution Rescuers": 0.01,
        "Pixel Puzzlers": 0.01,
        "Scrum Stars": 0.01,
        "Quality Guardians": 0.01,
        "Defect Detectors": 0.01,
        "Creative Crew": 0.01,
        "Debugging Divas": 0.01,
        "Productivity Partners": 0.01,
        "Solution Architects": 0.01,
        "Mighty Modellers": 0.01,
        "Innovation Explorers": 0.01,
        "Code Captains": 0.01,
        "Bug Banishers": 0.01,
        "Agile Allies": 0.01,
        "Innovation Initiators": 0.01
    },
    "RESOLUTION": {
        "Fixed": 0.15,
        "Won't Fix": 0.12,
        "Duplicate": 0.10,
        "Incomplete": 0.08,
        "Cannot Reproduce": 0.08,
        "Works as Intended": 0.07,
        "Not a Bug": 0.06,
        "Deferred": 0.05,
        "Duplicate of External Issue": 0.05,
        "Withdrawn by Reporter": 0.04,
        "Information Provided": 0.04,
        "Implemented": 0.03,
        "Out of Scope": 0.03,
        "Rejected": 0.02,
        "Invalid": 0.02,
        "Third Party Issue": 0.02,
        "Tested and Verified": 0.02,
        "Resolved": 0.01,
        "Postponed": 0.01,
        "Obsolete": 0.01
    },
    "IMPACT_AREA": {
        "UI/UX": 0.12,
        "Database": 0.10,
        "Security": 0.10,
        "Performance": 0.08,
        "Integration": 0.08,
        "Backend": 0.07,
        "Frontend": 0.07,
        "API": 0.06,
        "Infrastructure": 0.06,
        "Documentation": 0.05,
        "User Workflow": 0.05,
        "Reporting": 0.04,
        "Data Processing": 0.04,
        "Localization": 0.03,
        "Error Handling": 0.03,
        "Accessibility": 0.02,
        "Notifications": 0.02,
        "Analytics": 0.02,
        "Search Functionality": 0.01,
        "Deployment": 0.01
    },
    "TYPE": {
        "Bug": 0.12,
        "Task": 0.10,
        "Story": 0.10,
        "Epic": 0.08,
        "Improvement": 0.08,
        "New Feature": 0.07,
        "Sub-task": 0.07,
        "Documentation": 0.06,
        "Technical Task": 0.05,
        "User Story": 0.05,
        "Support": 0.04,
        "Test": 0.04,
        "Research": 0.03,
        "Spike": 0.03,
        "Security": 0.02,
        "Performance": 0.02,
        "Infrastructure": 0.02,
        "Maintenance": 0.01,
        "Duplicate": 0.01,
        "Other": 0.01
    },
    "STATUS": {
        "Open": 0.15,
        "In Progress": 0.12,
        "Resolved": 0.10,
        "Closed": 0.10,
        "Reopened": 0.08,
        "Blocked": 0.08,
        "On Hold": 0.07,
        "Pending": 0.07,
        "In Review": 0.06,
        "In Testing": 0.05,
        "Approved": 0.05,
        "Rejected": 0.04,
        "Deferred": 0.04,
        "Verified": 0.03,
        "In Validation": 0.03,
        "Awaiting Feedback": 0.02,
        "Canceled": 0.02,
        "Scheduled": 0.02,
        "Waiting for Dependency": 0.01,
        "Duplicate": 0.01
    },
    "PROJECT": {
        "Zenith": 0.08,
        "Aurora": 0.07,
        "Phoenix": 0.06,
        "Quicksilver": 0.06,
        "Stellar": 0.05,
        "Luminary": 0.05,
        "Elysium": 0.04,
        "Voyager": 0.04,
        "Nebula": 0.03,
        "Meridian": 0.03,
        "Orion": 0.03,
        "Celestial": 0.03,
        "Pulse": 0.02,
        "Equinox": 0.02,
        "Radiant": 0.02,
        "Serenity": 0.02,
        "Aegis": 0.02,
        "Ignite": 0.01,
        "Echo": 0.01,
        "Aether": 0.01,
        "Arcadia": 0.01,
        "Synapse": 0.01,
        "Nova": 0.01,
        "Chronos": 0.01,
        "Enigma": 0.01,
        "Olympus": 0.01,
        "Tempest": 0.01,
        "Eclipse": 0.01,
        "Apex": 0.01,
        "Labyrinth": 0.01,
        "Polaris": 0.01,
        "Nimbus": 0.01,
        "Avalanche": 0.01,
        "Alchemy": 0.01,
        "Resonance": 0.01,
        "Cascade": 0.01,
        "Halcyon": 0.01,
        "Empyrean": 0.01,
        "Tranquility": 0.01,
        "Inferno": 0.01,
        "Harmony": 0.01,
        "Utopia": 0.01,
        "Quantum": 0.01,
        "Epiphany": 0.01,
        "Momentum": 0.01,
        "Mirage": 0.01,
        "Chronicle": 0.01,
        "Vortex": 0.01,
        "Apogee": 0.01,
        "Synergy": 0.01
    },
    "INCIDENT": {
        "None": 0.60,
        "Critical": 0.08,
        "High": 0.07,
        "Medium": 0.06,
        "Low": 0.05,
        "Minor": 0.04,
        "Informational": 0.03,
        "Urgent": 0.02,
        "Escalated": 0.02,
        "Normal": 0.01,
        "Non-Critical": 0.01,
        "Warning": 0.01,
        "Notice": 0.01,
        "Advisory": 0.01,
        "Routine": 0.01,
        "Trivial": 0.01
    },
    "CUSTOMER_TYPE": {
        "Internal": 0.30,
        "External": 0.25,
        "VIP": 0.15,
        "Partner": 0.10,
        "Enterprise": 0.08,
        "Government": 0.05,
        "Educational": 0.03,
        "Non-Profit": 0.02,
        "Freelancer": 0.02,
        "Startup": 0.02,
        "Small Business": 0.01,
        "Mid-Sized Business": 0.01,
        "Large Business": 0.01,
        "Individual": 0.01,
        "Other": 0.01
    },
    "CUSTOMER_IMPACT": {
        "High": 0.20,
        "Medium": 0.18,
        "Low": 0.16,
        "Critical": 0.14,
        "Significant": 0.12,
        "Minimal": 0.10,
        "Major": 0.08,
        "Negligible": 0.04,
        "Moderate": 0.03,
        "Minor": 0.02,
        "Severe": 0.02,
        "Marginal": 0.01,
        "Insignificant": 0.01,
        "Critical Impact": 0.01,
        "No Impact": 0.01
    },
    "CUSTOMER_ENVIRONMENT": {
        "Production": 0.25,
        "Staging": 0.20,
        "Development": 0.15,
        "Testing": 0.10,
        "Demo": 0.08,
        "Pre-Production": 0.06,
        "QA": 0.05,
        "UAT": 0.04,
        "Sandbox": 0.03,
        "Integration": 0.02,
        "Backup": 0.02,
        "Disaster Recovery": 0.02,
        "Training": 0.01,
        "Other": 0.01,
        "Not Applicable": 0.01
    },
    "REQUIRED_ON_CALL": {
        "Yes": 0.35,
        "No": 0.30,
        "Sometimes": 0.15,
        "24/7": 0.08,
        "On Rotation": 0.05,
        "Only Business Hours": 0.03,
        "Emergency Only": 0.02,
        "Weekends Only": 0.01,
        "Holidays Only": 0.01,
        "After Hours": 0.01,
        "As Needed": 0.01,
        "Never": 0.01,
        "Rarely": 0.01,
        "Occasionally": 0.01,
        "Frequently": 0.01
    },
    "NEEDS_CUSTOMER_UPDATE": {
        "Yes": 0.25,
        "No": 0.20,
        "Sometimes": 0.15,
        "On Resolution": 0.10,
        "On Request": 0.08,
        "On Milestone": 0.06,
        "Regularly": 0.05,
        "On Major Updates": 0.04,
        "On Critical Issues": 0.03,
        "Weekly": 0.02,
        "Monthly": 0.02,
        "Quarterly": 0.02,
        "Annually": 0.01,
        "As Needed": 0.01,
        "Never": 0.01
    },
    "NEEDS_POSTMORTEM": {
        "Yes": 0.30,
        "No": 0.25,
        "Sometimes": 0.15,
        "For Critical Incidents": 0.10,
        "For Major Incidents": 0.08,
        "For Severe Incidents": 0.06,
        "For Service Outages": 0.05,
        "For Security Breaches": 0.04,
        "For Data Loss": 0.03,
        "On Request": 0.02,
        "On Compliance Violations": 0.02,
        "On Infrastructure Failures": 0.02,
        "On Software Bugs": 0.01,
        "On User Errors": 0.01,
        "Never": 0.01
      }      
}